StevenTran-steventran06/Exercise_App/app/controllers/exercises_controller.rb

  def index
    @exercises = Exercise.all
---
SELECT "exercises".* FROM "exercises"