StevenTran-steventran06/Exercise_App/app/controllers/schedules_controller.rb

SELECT "schedules".* FROM "schedules" WHERE "schedules"."user_id" = ? AND (day == '2')  [["user_id", "1"]]
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."exercise" = ?  ORDER BY "exercises"."id" ASC LIMIT 1  [["exercise", "Split Squat with Dumbbells"]]
---
  def index
    @date = Time.now.in_time_zone("Pacific Time (US & Canada)").strftime("%A")
    @schedules = current_user.schedules
    @todaysschedule = @schedules.where('day == :query', query: "#{@date}")
    @exercises = Exercise.all

INSERT INTO "schedules" ("day", "muscle_group", "user_id", "random_exercise", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @schedule = Schedule.new(schedule_params)
    @schedule.user_id = current_user.id
    set_random_exercise(@schedule)

    respond_to do |format|
      if @schedule.save

SELECT "schedules".* FROM "schedules"
---
  def new
    @schedule = Schedule.new
    @schedules = Schedule.all

SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_schedule
    @schedule = Schedule.find(params[:id])

SELECT "exercises".* FROM "exercises" WHERE (main_muscle_worked LIKE 'Quadriceps')
---
  def set_random_exercise(schedule)
    schedule.random_exercise = Exercise.where('main_muscle_worked LIKE :query', query: "#{@schedule.muscle_group}").sample.exercise